# Задача 4: Напишите программу, которая проверяет, 
# является ли введенное пользователем число больше 10.
# Цель: Использование оператора сравнения.
num = int(input("Number: "))
x = 10
print(num > 10)