# Задача 1: Создайте переменную age и присвойте ей ваше возраст. 
# Напечатайте значение этой переменной.
# Цель: Работа с переменными.

age = int(input("Введите ваш возраст: "))

print(f"Мой возраст {age} лет")