# Задача 8: Напишите программу, которая запрашивает у 
# пользователя два числа 
# и выводит их среднее значение.
num1 = int(input("num1: "))
num2 = int(input("num2: "))
print((num1 + num2)/2)