# Реализуйте программу, которая запрашивает у пользователя его возраст и 
# говорит, через сколько лет ему будет 100.

age = input("Сколько тебе лет?")
div= 100 - int(age)
print(f"Через {div} лет тебе будет 100!")