# Задача 3: Преобразуйте строку "25" в целое число и выведите результат.
# Цель: Работа с типами данных и их преобразование.

num_str = '25'
num = int(num_str)
print(num)